{
  "personalInfo": {
    "name": "William Wenstein",
    "title": "Data Analyst",
    "avatar": "./assets/images/william2.png",
    "contacts": {
      "address": "Jl. Taman Daan Mogot Raya No.39, RT.3/RW.1, Tj. Duren Utara, Kec. Grogol petamburan, Kota Jakarta Barat, Daerah Khusus Ibukota Jakarta 11470",
      "email": "wensteinwilliam@gmail.com",
      "personalInterest": "Data Analytics",
      "mobileNumber": "+6285221218686"
    },
    "resumeUrl": "./assets/docs/CV_ATS_HAIKAL.pdf",
    "social": [
      {
        "name": "Github",
        "url": "https://github.com/wilwillie",
        "icon": "logo-github"
      },
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/william-wenstein/",
        "icon": "logo-linkedin"
      },
      {
        "name": "Instagram",
        "url": "https://instagram.com/wilwstn",
        "icon": "logo-instagram"
      }
    ],
    "about": [
      "<p><strong>Hi! I’m William</strong>, a 3rd-year Computer Science student at <strong>Tarumanagara University</strong> with a strong passion for <em>data analytics</em> and statistical computing.</p>",
      "<p>I enjoy working with data — from cleaning and processing to turning it into meaningful insights that help solve real-world problems.</p>",
      "<p>I’ve gained hands-on experience using <strong>Python, SQL, and Excel</strong> for data analysis, visualization, and predictive modeling. My main interest lies in how data and technology can be leveraged to optimize business processes and support evidence-based decision-making.</p>",
      "<p>I’m always excited to learn new analytical tools, explore datasets, and contribute to projects that bridge technical understanding with real impact.</p>"
    ]
  },

  "services": [
    {
      "icon": "./assets/images/icon-design.svg",
      "title": "Data Analysis",
      "description": "Transforming raw data into meaningful insights through data cleaning, visualization, and statistical modeling."
    },
    {
      "icon": "./assets/images/icon-dev.svg",
      "title": "Machine Learning & Predictive Modeling",
      "description": "Building analytical models using Python and MATLAB to uncover trends, patterns, and predictions from datasets."
    },
    {
      "icon": "./assets/images/icon-dev.svg",
      "title": "Data Visualization & Dashboarding",
      "description": "Creating interactive dashboards and visual reports using Power BI and Tableau for data-driven decision-making."
    },
    {
      "icon": "./assets/images/icon-app.svg",
      "title": "Web & Application Development",
      "description": "Developing responsive websites and analytical tools using HTML, CSS, JS, PHP, and Flutter."
    }
  ],

  "resume": {
    "education": [
      {
        "school": "Tarumanagara University",
        "faculty": "Faculty of Information Technology",
        "major": "Computer Science",
        "degree": "Undergraduate (3rd Year)",
        "years": "Aug 2023 – May 2027 (Expected)",
        "gpa": "3.65"
      }
    ],
    "experience": [
      {
        "position": "Permanent Member of the Public Relations Committee",
        "company": "Student Representative Council (DPM FTI Untar)",
        "years": "July 2024 – July 2025",
        "description": "Managed and scheduled social media content to maintain audience engagement and brand consistency. Collaborated with other divisions to ensure alignment between media content and organizational activities. Designed and reviewed visual and written materials for organizational events and announcements."
      },
      {
        "position": "Junior Member of the Public Relations Committee",
        "company": "Student Representative Council (DPM FTI Untar)",
        "years": "Nov 2023 – July 2024",
        "description": "Designed visual content for national and religious celebrations as part of the organization's public communication strategy. Collaborated with the PR team to ensure visual messages aligned with the organization’s values and identity."
      },
      {
        "position": "Data Entry & Reporting Intern",
        "company": "PT Palma Abadi",
        "years": "Oct 2022 – Dec 2022",
        "description": "Consolidated and cleaned harvest ticket datasets from multiple sources into a single master Excel file for operational reporting. Improved data merging accuracy by reducing manual errors through advanced Excel functions (IF, VLOOKUP, HLOOKUP, Pivot Tables). Collaborated with accounting and operations teams to ensure consistency between over 500 physical documents and corresponding digital records."
      }
    ],
    "skills": [
      {
        "name": "Office & Analytical Tools (Excel, MATLAB, Google Colab, Jupyter)",
        "level": 95
      },
      {
        "name": "Data Analysis & Visualization",
        "level": 90
      },
      {
        "name": "Programming (Python, SQL, C++, PHP, JS)",
        "level": 85
      },
      {
        "name": "Web & Mobile Development",
        "level": 85
      },
      {
        "name": "Statistical & Machine Learning Methods",
        "level": 80
      }
    ]
  }
}
